#1- Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, 
 #и проверяет, является ли этот день выходным.
#Дополнительно: можете проверить, что это действительно число, 
# и что это действительно входит в нужный диапазон



def week_day (d):
   
    if d == 6 or d == 7:
        return "сегодня выходной"
    if 0 < d and d < 6:
        return "сегодня будний день" 
    if 0>= d or d>7:
        return "неверно задан день"

print(week_day(int(input(" Введите номер дня недели  "))))  


#Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
#Нужно написать таблицу истинности.
#0 - ложь
#1 истина

#one_pred = ['x', 'y', 'z']
#two_pred = ['x', 'y', 'z']
       
for x in range(2):
    for y in range(2):
        for z in range(2):
            print(not x or not y or not z) == (not(x or y or z))
            print(x,y,z)


#Напишите программу, которая принимает на вход координаты точки (X и Y),
 #причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
 #в которой находится эта точка (или на какой оси она находится).

#Пример:

#x=34; y=-30 -> 4
#x=2; y=4-> 1
#x=-34; y=-30 -> 3
a='находится в четверти:',1
b='находится в четверти:',2
c='находится в четверти:',3
e='находится в четверти:',4

def coordinate_d(x,y):
    if x == 0 and y == 0:
        print ('Введите число больше или меньше 0 ')
    if x > 0 and y > 0:
        return a
    if x < 0 and y > 0:
        return b
    if x < 0 and y < 0:
        return c
    if x > 0 and y < 0:
        return e   
print(coordinate_d(int(input("Введите координату х: ")), int(input("Введите координату y: "))))


#print(("координата находится в четверти " ))




#4-Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
#Пример:
#- quarter = 1 => x∈(0, ∞) u y∈(0,∞)  
# ∈ - это принадлежность к множеству  

def range_coordinate(q):
    if q == 1:
        return "диапозон: x∈(0, ∞) u y∈(0,∞)"
    if q == 2:
        return "диапозон: x∈(1, ∞) u y∈(-1,∞)"
    if q == 3:
        return "диапозон: x∈(-1, - ∞) u y∈(-1,-∞)" 
    if q == 4:
        return "диапозон: x∈(-1, - ∞) u y∈(1,-∞)" 

print(range_coordinate(int(input("Введите четверть  "))))

#5- Напишите программу, которая принимает на вход координаты 
#двух точек и находит расстояние между ними в 2D пространстве.

#Пример:

#A (3,6); B (2,1) -> 5.09
#A (7,-5); B (1,-1) -> 7.21

coord_a = [7,-5]
coord_b = [1,-1]

print('длина отрезка - ' + str(round(((coord_b[0] - coord_a[0]) ** 2 + (coord_b[1] - coord_a[1]) ** 2) ** 0.5, 2)))


        

